Dans ce TP, nous considérons des trajets en vélo partagé (similaire au Vélib) en Californie. Deux jeux de données sont fournis : l'un qui contient les stations de vélo, l'autre, les trajets à vélo. Les déplacements à vélo se font d'une station à l'autre.

In [84]:
from pathlib import Path
import sqlite3

import pandas as pd

In [ ]:
DATA_DIR = Path("../../data")

Charger le fichier stationData.csv dans un DataFrame `station_df` et le fichier tripData.csv dans un DataFrame `trip_df`. Pour chaque DataFrame, il vous faudra demander une inférence des schémas et indiquer que la première ligne est un en-tête.

In [86]:
station_df = pd.read_csv(Path(DATA_DIR, "stationData.csv"))
trip_df = pd.read_csv(Path(DATA_DIR, "tripData.csv"))

In [87]:
type(station_df)

pandas.core.frame.DataFrame

Afficher les schémas/informations des deux DataFrames.

In [67]:
display(station_df.head(15))
display(station_df.tail())

,station_id,name,lat,long,dockcount,landmark,installation
0,2,San Jose Diridon Caltrain Station,37.329732,-121.901782,27,San Jose,8/6/2013
1,3,San Jose Civic Center,37.330698,-121.888979,15,San Jose,8/5/2013
2,4,Santa Clara at Almaden,37.333988,-121.894902,11,San Jose,8/6/2013
3,5,Adobe on Almaden,37.331415,-121.893200,19,San Jose,8/5/2013
4,6,San Pedro Square,37.336721,-121.894074,15,San Jose,8/7/2013
5,7,Paseo de San Antonio,37.333798,-121.886943,15,San Jose,8/7/2013
6,8,San Salvador at 1st,37.330165,-121.885831,15,San Jose,8/5/2013
7,9,Japantown,37.348742,-121.894715,15,San Jose,8/5/2013
8,10,San Jose City Hall,37.337391,-121.886995,15,San Jose,8/6/2013
9,11,MLK Library,37.335885,-121.885660,19,San Jose,8/6/2013
10,12,SJSU 4th at San Carlos,37.332808,-121.883891,19,San Jose,8/7/2013
11,13,St James Park,37.339301,-121.889937,15,San Jose,8/6/2013
12,14,Arena Green / SAP Center,37.332692,-121.900084,19,San Jose,8/5/2013
13,16,SJSU - San Salvador at 9th,37.333955,-121.877349,15,San Jose,8/7/2013
14,21,Franklin at Maple,37.481758,-122.226904,15,Redwood City,8/12/2013

,station_id,name,lat,long,dockcount,landmark,installation
65,77,Market at Sansome,37.789625,-122.400811,27,San Francisco,8/25/2013
66,80,Santa Clara County Civic Center,37.352601,-121.905733,15,San Jose,12/31/2013
67,82,Broadway St at Battery St,37.798541,-122.400862,15,San Francisco,1/22/2014
68,83,Mezes Park,37.491269,-122.236234,15,Redwood City,2/20/2014
69,84,Ryland Park,37.342725,-121.895617,15,San Jose,4/9/2014

In [10]:
station_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70 entries, 0 to 69
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   station_id    70 non-null     int64
 1   name          70 non-null     object
 2   lat           70 non-null     float64
 3   long          70 non-null     float64
 4   dockcount     70 non-null     int64
 5   landmark      70 non-null     object
 6   installation  70 non-null     object
dtypes: float64(2), int64(2), object(3)
memory usage: 4.0+ KB

In [11]:
station_df.describe()

       station_id        lat        long  dockcount
count   70.000000  70.000000   70.000000  70.000000
mean    43.000000  37.590243 -122.218416  17.657143
std     24.166092   0.203473    0.209446   4.010442
min      2.000000  37.329732 -122.418954  11.000000
25%     24.250000  37.389483 -122.400601  15.000000
50%     43.500000  37.631163 -122.312123  15.000000
75%     63.750000  37.788123 -122.078009  19.000000
max     84.000000  37.804770 -121.877349  27.000000

In [34]:
trip_df.head()

,TripID,Duration,StartDate,StartStation,StartTerminal,EndDate,EndStation,EndTerminal,Bike#,SubscriberType,ZipCode
0,913460,765,8/31/2015 23:26,Harry Bridges Plaza (Ferry Building),50,8/31/2015 23:39,San Francisco Caltrain (Townsend at 4th),70,288,Subscriber,2139
1,913459,1036,8/31/2015 23:11,San Antonio Shopping Center,31,8/31/2015 23:28,Mountain View City Hall,27,35,Subscriber,95032
2,913455,307,8/31/2015 23:13,Post at Kearny,47,8/31/2015 23:18,2nd at South Park,64,468,Subscriber,94107
3,913454,409,8/31/2015 23:10,San Jose City Hall,10,8/31/2015 23:17,San Salvador at 1st,8,68,Subscriber,95113
4,913453,789,8/31/2015 23:09,Embarcadero at Folsom,51,8/31/2015 23:22,Embarcadero at Sansome,60,487,Customer,9069

In [14]:
trip_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 354152 entries, 0 to 354151
Data columns (total 11 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   TripID          354152 non-null  int64
 1   Duration        354152 non-null  int64
 2   StartDate       354152 non-null  object
 3   StartStation    354152 non-null  object
 4   StartTerminal   354152 non-null  int64
 5   EndDate         354152 non-null  object
 6   EndStation      354152 non-null  object
 7   EndTerminal     354152 non-null  int64
 8   Bike#           354152 non-null  int64
 9   SubscriberType  354152 non-null  object
 10  ZipCode         353874 non-null  object
dtypes: int64(5), object(6)
memory usage: 29.7+ MB

In [15]:
trip_df.describe()

,TripID,Duration,StartTerminal,EndTerminal,Bike#
count,354152.000000,3.541520e+05,354152.000000,354152.000000,354152.000000
mean,676962.274416,1.046033e+03,58.446018,58.421816,422.957911
std,138874.153513,3.001694e+04,16.738860,16.876792,159.841550
min,432947.000000,6.000000e+01,2.000000,2.000000,9.000000
25%,557009.750000,3.420000e+02,50.000000,50.000000,327.000000
50%,679451.500000,5.110000e+02,62.000000,63.000000,437.000000
75%,798026.250000,7.390000e+02,70.000000,70.000000,546.000000
max,913460.000000,1.727040e+07,84.000000,84.000000,878.000000

Créer une base SQLite ainsi qu'une vue SQL pour chaque DataFrame.

In [28]:
conn = sqlite3.connect(":memory:")
station_df.to_sql("station", conn, if_exists="replace")

70

In [29]:
trip_df.to_sql("trip", conn, if_exists="replace")

354152

Trouver deux façons de calculer le nombre de trajets, l'une en appelant une méthode sur `trip_df` directement, l'autre en rédigeant une requête SQL sur la vue correspondante.

In [31]:
# Méthode 1 : SQL
query = "SELECT COUNT(*) FROM trip"
pd.read_sql(query, conn)

   COUNT(*)
0    354152

In [32]:
# Méthode 2 : syntaxe pandas
len(trip_df)

354152

In [33]:
trip_df["TripID"].count()

np.int64(354152)

Écrire des instructions permettant de compter le nombre de trajets qui démarrent et se terminent à la même station.

In [38]:
circular_trip_mask = trip_df["StartTerminal"] == trip_df["EndTerminal"]

In [45]:
circular_trip_mask

0         False
1         False
2         False
3         False
4         False
          ...
354147    False
354148    False
354149    False
354150    False
354151    False
Length: 354152, dtype: bool

In [40]:
circular_trip_mask.value_counts()

False    343876
True      10276
Name: count, dtype: int64

In [41]:
circular_trip_mask.sum()

np.int64(10276)

In [46]:
len(trip_df[circular_trip_mask])

10276

Obtenir l’id des stations associées à ces trajets. Écrire une requête renvoyant la liste des terminaux concernés ainsi que le nombre de trajets pour chacun de ces terminaux. Trier le résultat par ordre décroissant de nombre de trajets.

In [73]:
count_df = trip_df[
    circular_trip_mask
].groupby(
    "StartTerminal"
).size( 
).sort_values(
    ascending=False
).reset_index(
    name="circular_trip_count"
)

In [74]:
count_df

    StartTerminal  circular_trip_count
0              60                  850
1              50                  708
2              35                  348
3              76                  320
4              74                  307
..            ...                  ...
65             80                   26
66             24                   23
67             83                   21
68             21                   12
69             26                    7

[70 rows x 2 columns]

In [80]:
count_bis_df = trip_df[
    circular_trip_mask
].groupby(
    "StartTerminal"
).agg(
    nb_traj=("TripID", "count")
).sort_values(
    by="nb_traj",
    ascending=False,
)

In [82]:
count_bis_df.reset_index()

    StartTerminal  nb_traj
0              60      850
1              50      708
2              35      348
3              76      320
4              74      307
..            ...      ...
65             80       26
66             24       23
67             83       21
68             21       12
69             26        7

[70 rows x 2 columns]

Compléter le résultat en indiquant le nombre de docks (dockcount) des stations concernées.

In [78]:
result_df = count_df.merge(
    station_df[["station_id", "dockcount"]],
    how="left",
    left_on="StartTerminal",
    right_on="station_id",
).drop("StartTerminal", axis=1)

In [79]:
result_df.head()

   circular_trip_count  station_id  dockcount
0                  850          60         15
1                  708          50         23
2                  348          35         11
3                  320          76         19
4                  307          74         23

In [ ]:
result_df = pd.merge(
    count_df,
    station_df[["station_id", "dockcount"]],
    how="left",
    left_on="StartTerminal",
    right_on="station_id",
).drop("StartTerminal", axis=1)